import React, { useState, useRef } from "react";
import style from "../../../global-style";
import styled from "styled-components";

const Section = styled.div`
  text-align: center;

  .bar {
    border: 1px solid #e5e5e5;
    margin: 15px 0;
  }
  .title {
    font-size: ${style["font-size-l"]};
    line-height: ${style["line-height-3"]};
    margin-bottom: 20px;
  }

  .article {
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    width: 100%;
    /*margin-right: 2rem; */
    margin-bottom: 20px;
    color: ${style["font-color-light-1"]};
    &--image {
      width: 50vw;
    }
    &--title {
      margin: 3rem auto;
      width: 100%;
      font-size: ${style["font-size-l"]};

      /* margin: 0 50%; */
    }
    &--content {
      /* margin: 5rem; */
      font-size: ${style["font-size-m"]};
      line-height: ${style["line-height-l"]};
      height: ${(props) => (props.expand ? "" : "250px")};
      overflow: ${(props) => (props.expand ? "none" : "hidden")};
    }
    &--expand {
      font-size: ${style["font-size-s"]};
      display: flex;
      align-items: center;
      margin: 10px auto;
      cursor: pointer;
      color: ${style["highlight-color"]};
    }
  }
  .articles {
    display: grid;
    grid-template-columns: repeat(2, 50%);

    grid-column-gap: 10px;
    width: 100%;
    height: ${(props) => (props.more ? "" : "11rem")};
    overflow: ${(props) => (props.more ? "none" : "hidden")};
  }
  .button {
    border: none;
    color: ${style["highlight-color"]};
    font-size: ${style["font-size-m"]};
    background-color: transparent;
    padding: 10px;
    cursor: pointer;
    transition: all 0.2s;
    border-bottom: 1px solid transparent;
    :hover {
      font-weight: bold;
      transform: translateX(10px) scale(1.03);
      border-bottom: 1px solid ${style["highlight-color"]};
    }
  }
`;
const ArticleItem = styled.div`
  display: flex;
  /* justify-content: space-between; */
  align-content: center;
  width: 100%;
  height: 11rem;
  padding: 1rem;
  border: 2px solid
    ${(props) => (props.active ? style["highlight-color"] : "transparent")};
  cursor: pointer;
  .shape {
    flex: 0 0 25%;
    height: 100%;
    width: 100%;
    margin: 0 auto;
    display: block;
    object-fit: cover;
  }
  .image {
    height: 100%;
    /* transform: scale(0.6); */
    transition: all 0.2s;
  }
  .text {
    flex: 1;
    text-align: left;
    padding: 5px;
    overflow: hidden;
  }
  .title {
    font-size: ${style["font-size-m"]};
    line-height: ${style["line-height-l"]};
  }
  .content {
    font-size: ${style["font-size-s"]};
    line-height: ${style["line-height-l"]};
  }
`;
const BuddyVideo = React.forwardRef((props, ref) => {
  const expandIcon = (
    <svg
      t="1594653945712"
      className="icon"
      viewBox="0 0 1024 1024"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      p-id="1988"
      width="28"
      height="28"
    >
      <path
        d="M841.7526317 251.66897446l-338.43033323 338.43033322L164.89196525 251.66897446a83.9133679 83.9133679 0 0 0-121.48781124 0 83.9133679 83.9133679 0 0 0 0 121.48781125l399.17423984 399.17423983a83.9133679 83.9133679 0 0 0 121.48781126 0l399.17423987-399.17423983A85.90923843 85.90923843 0 1 0 841.7526317 251.66897446z"
        p-id="1989"
        fill="#FFC368"
      ></path>
    </svg>
  );
  const closeIcon = (
    <svg
      t="1594654569715"
      className="icon"
      viewBox="0 0 1024 1024"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      p-id="2777"
      width="32"
      height="32"
    >
      <path
        d="M240.2922041 726.50615507l278.85800163-278.85800161L798.00820735 726.50615507a69.14248454 69.14248454 0 0 0 100.10287181 0 69.14248454 69.14248454 0 0 0 0-100.10287181l-328.90943835-328.90943833a69.14248454 69.14248454 0 0 0-100.10287182 0l-328.90943838 328.90943833A70.78703118 70.78703118 0 1 0 240.2922041 726.50615507z"
        p-id="2778"
        fill="#FFC368"
      ></path>
    </svg>
  );
  const articles = [
    {
      userid: "2",
      articleId: 1,
      title: "你好，我叫程卓",
      content: [
        "我从小在新疆乌鲁木齐长大，直到大学前都是一个生活以刷题为主旋律的小朋友。在2009年，我以新疆理科第一名的成绩考入了清华大学，然后立刻体验了一回边远地区同学被学术碾压的巨大落差（泪目）。",
        "之后不断寻找方向，寻找定位。学习成绩中不溜，没挤进团委学生会的“大舞台”，作为商科学生居然大三过了一半才开始第一份实习…… 终于，在大三结束之前找到了自己的“点”，义无反顾地扎进去做到极致，最终在毕业时获得了最想去的公司的offer。",
        "从高中“实验班”、大学“状元班”、麦肯锡“总裁班”，到后来的麻省理工和哈佛大学“很有面子班”，我短暂的人生经历了无数“天纵英才”型的选手，而他们则成功地把我锻炼成了一枚“小强”型选手。我很早就看到了自己在数理化上面的极限，所以果断转了社会学科；我的第一份实习是做走街串巷的推销员，那就当锻炼脸皮嘴皮；哈佛申请了三年四遍，创业做散了四拨团队……这些才是人生常态，要像一个“小强”一样去面对。",
        "我不认为自己天分卓群，但是作为普通人，也有自己的生存本领。比如说，我从来不妄想在许多方面都比别人强；相反，我会找准最适合自己的一两件事，做到极致。我从来都不认为自己的任何一个观点是完全正确的，只能不断小心地增加正确的概率，随时准备被纠正甚至推翻。我至今没有完全克服打游戏上瘾的问题，所以我的办法就是，尽量不去碰它……",
        " 如果你也找不到奋斗的方向，如果你也挣扎在强手如林的地方，如果你也对自己的明天怀有期待，那我的存在就是一个好消息。作为一个普通人，我们一样可以扬长避短，加上一点点笑对失败的“小强”精神，最终得到那些我们羡慕的东西。I have been there, and we can make it.  ",
        "期待成为你的Buddy，让我陪你笑对挫折，让我们一起寻找方向，让我们成为更好的人。",
      ],
      image: "21.png",
      active: true,
    },
    {
      userid: "2",
      articleId: 2,
      title: "集齐名校名企光环后，他想为所有人建一所心灵驿站",
      content: [
        "“状元”的大学生活",
        "01. 提一个大家都很想问的问题，怎样能学成高考状元呢？",
        "程卓: 回答这个问题之前，可能要先思考一下，我们是不是一定要当状元。我觉得更重要的是想清楚为什么要学习。以前在一土学校做过一段时间，一个教学理念是说要帮助孩子去探索真正喜欢和追求的，告诉他这些考试是目前实现理想的必经之道，那孩子自己就会很有动力去学习。这可能是我们要多去思考的一个问题。",
        "具体怎么提高分数呢，其实我们国内教育已经有了大量经验，我也只能说对我个人启发比较大的几点。第一点就是重复训练，很多时候一个知识点觉得理解就掌握了，但其实大量的重复训练还是挺有必要的，科比会投篮，但是为什么还要每天练投篮？",
        "另一点还是想清楚自己要什么，同时明确是否考到一个好学校，就是实现梦想的一个最好办法。如果是的话，就有动力去学习。",
        "02. 到了清华这个学霸云集的平台，最开始适应得如何？",
        "程卓：我听过很多“有落差”之类的故事，但说实话我自己倒是没体验过。",
        "这一点非常感谢当时清华经管学院的院长，他在开学第一课上给我们讲了非常重要的一点，他说GPA不是那么重要，更重要的是长成一个有全面素质的人。他提出了几个具体要求——好奇心、想象力和批判性思维的能力，我当时听起来觉得“只道是寻常”，现在回头想真的很重要，这几点也是对我影响巨大的。",
        "另外是清华经管学院的教学理念，就是宽口径通识教育。我们的院长有在哈佛教书的经历，他就把 Harvard College 的 Liberal Arts Education 理念来带回来。我们在前两年会学习大量通识教育的课程，比如我们专业是经济与金融，但还会学习中国文明、西方文明、心理学、生物学等等，物理甚至会学到量子力学。这样的方式告诉我们，其实学的技巧是次要的。我的成绩一直是中等偏上，但是这样的教育模式让不同类型的人才都能找到自己的归宿，所以我没有特别焦虑，最后也找到了适合我的职业出路。",
        "03. 毕业后你去了麦肯锡，在大学中你怎样探索并发现自己的职业兴趣？",

        "程卓：我经常跟别人开玩笑说，学了四年经济与金融，最后发现自己既不喜欢经济，也不喜欢金融，然后就去做了管理。",

        "其实我进入职业的领域也算比较晚。我的第一份实习在大三寒假，对于一个商科学生已经很晚了，但是真正做实习后，我也开始去不同的领域探索。",
        "第一份实习是在墨尔本当推销员，走街串巷，非常有趣，也让我收获了很多的 learning。然后我还做过审计，也做过其他的东西。在那阵正好有一个刚刚兴起的事物，商业案例大赛，我就跟同学参加了一次，发现非常喜欢，你能够和一群非常聪明的人，为了一个共同目标密切地合作，去为企业解决一个非常重要的战略问题。这个过程我非常享受，当时前前后后参加了9个国内外的比赛，后来也成为清华案例队的队长。这段经历让我确定自己很喜欢做咨询，后来做这个选择我也不后悔。",
        "在麦肯锡疯狂成长",
        "04. 进了麦府后，与你的预期一样吗？如果要在预期和收获之间画一个符号会是什么？",
        "程卓：收获远超我的预期。在一次内部分享会上，有位领导也提到，几乎每一个麦肯锡的人都会经历一个过程，刚来时很自信，然后自信被逐渐打碎瓦解，再慢慢地靠着 resilience（韧性）上升，达到一个更高的高度。",
        "刚入职培训完，大家分享感想时，我说我准备好了，等不及要上项目大干一场。这是我当时的原话。但是第一个项目就被狠狠地“打了脸”，太艰难了。后来经历了一段漫长的挣扎时期，直到第二年，我突然在一个项目上开窍了，就越做越顺手，找到了节奏。我觉得每个人都会体验这样一个过程，预期是按部就班地做到一个程度，然后你发现自己做不到，于是被逼着努力，最终发现自己居然做到了更高的一个程度。",
        "在这个过程中，我觉得 resilience 很重要。麦肯锡看中的也是学习能力强，要不怕困难，不容易被打倒。其实大家都是不断地把自己推到极限，再不断地达到更高的高度，每次挑战都是一个 new learning zone，把你抛出到舒适区之外，你要去面对挑战，收获世界给你的反馈。",
        "05. 在麦肯锡工作很忙，你觉得如何能在高强度的工作里面，平衡工作、生活和自我提升？",
        "程卓: 首先说工作和自我提升，我觉得有一个点，工作的过程就是成长的过程。麦肯锡有一个叫DGL (Development Group Leader) 的领导负责评估你的表现，为个人发展提供建议指导。记得我在第三年的时候，有一次想申请externship（麦肯锡的项目，可以申请去另外的企业做一段时间），我的 DGL就反对，当时我很不理解，其他很多人都做了externship，而且这个企业也很好。他就说，“我的建议是基于你的成长，而不是什么东西放在简历上会更好。你现在需要做更多的咨询项目，磨练自己的技能。”麦肯锡背后有一个很强的观念，就是每个人为自己的成长去努力工作，这是我们成长的方式。",
        "再说生活和工作，李一诺有次在清华分享时说过一个概念，叫 work-life integration。以前大家会经常说 work-life balance，但这是把工作和生活对立起来，而这两方面其实可以非常有机地融合起来。比方说为了和家人共度时光，就立一个规矩，每天晚上一定要和家人一起吃饭，吃完饭了我可以再继续工作，这些很小的方面能够让你的工作和生活不互相抵触地无缝融合在一起。而且如果你真的热爱一份工作，或者责任足够大，是很难将工作与生活完全分开的。",
        "06. 你怎么看咨询行业接下来的发展，会遇到什么机遇或转折吗？",
        "程卓：这个问题特别好，也是我这学期一门课的小组项目，寻找咨询公司未来会面对的挑战和机会，先分享一些初步的想法。有人说咨询是个很年轻的行业，但我觉得它挺古老的，至少在诸葛亮那个时代就有了。咨询的核心是解决问题，而无论外界怎么变，解决问题的能力永远是稀缺的，所以我觉得咨询公司会一直存在，但可能解决问题的方式会随着时代不同、科技理念的进化而变化。",
        "具体来说，我们小组正在研究的一个话题是未来的大数据和 advanced analytics 会如何影响咨询公司。它们究竟是会替换咨询行业，还是会为咨询行业赋能；而从咨询行业的角度来说，我们如何能够通过有效的设计和战略安排来让它们为我们赋能。",
        "一土学校的初创经历",
        "07. 麦肯锡的时候，为什么会选择请假无薪去做一土学校的项目？",
        "程卓: 也是缘分，当时自己希望做些不一样的事，而麦肯锡鼓励我们全面发展的理念对我也有些潜移默化的影响。我觉得做一土学校的经历，也是一个从社会创业的角度锻炼自己领导力的方式。",
        "同时我觉得这是个有意义的事儿，大家都知道教育领域还有很多事情可以去做；一诺（李一诺女士）也是一个我非常佩服的 leader，希望能够在跟她的合作中学习，所以这些原因综合在一起，我做了这样的选择。",
        "08.  你在一土学校做了哪些方面的工作？",
        "程卓: 各种事情，一土学校最开始的状态跟多数创业公司一样，就是 everybody covers everything。我自己投入比较多的是课程设计和教研的项目管理，后来参与了薪酬体系和教师激励体系的设计，还有未来校园的体系扩张，帮助更多新校区纳入一土的经验等等。",
        "09. 当时没有教育方面的学科背景，是怎样快速上手这些工作的？",
        "程卓: 一方面是咨询师快速学习的看家本领哈哈，另一方面，我们和老师也是互补和互相学习的状态。老师们对于如何教学生是非常有能力的，在方面我不会过多干涉，而我更多从项目管理的角度，比如大家如何在一个设定的时间表里完成重要的事项等等。",
        "这是一个互相学习的过程，比如每次校长跟我开完会都觉得太高效了，以后都要这样开会；我也从校长那儿学到很多，比如以前我希望把东西都制度化，规定老师每个月要去旁听多少节课，校长就不同意，觉得这样的指标可能会打击老师的积极性。最初我不太理解，后来发现在没有指标的时候老师们也都非常积极地去旁听、做教研。",
        "这件事令我印象特别深刻，自己以前给很多大企业做项目管理，都很强调制度化，东西要落到纸面上。但在这里我看到了另一种管理方式，是把“气儿”都聚到一起，大家就能一起往前走，甚至走得更快。而后来我也看到很多非常厉害的领导者，都是靠这种共同的value来管理。",
        "10. 一土学校在你的履历中算是非常不同的一段经历，你觉得最大的收获是什么？",
        "程卓: 首先从创业技巧这方面，它让我第一次进入创业领域，以前我觉得创业离我很遥远，但是在做一土的过程中我发现原来创业这么近。我现在读 MBA，关注的也是创业创新，一土为我打开了一扇门。",
        "再从更高的一个层面来说，我觉得一土给我的认知植入了“社会创业”这个概念。它让我意识到一种东西叫社会企业，有一种创业的方式是去追求社会影响力和商业影响力的最好平衡。",
        "与哈佛相爱相杀，在 MIT 学创业",
        "11. 你四年申请了三次哈佛，如何能做到这么执着？每次申请时的心态有变化吗？",
        "程卓: 一方面也是名校情结，希望能够去到全球最好的平台学习，无论是哈佛，MIT，还是其他学校，我觉得都是非常好的平台。另一方面也看缘分，你要相信自己是个非常优秀的人，最后就看花落谁家了。",
        "另外可能是我的成功观，我觉得不需要次次都成功，只要成功一两次就可以了。以前读书的时候，觉得做考卷就必须把所有题都做对，拿满分，但其实人生不是这样。人生不是要把每一道选择题都选对，也不是要把每一个事情都做成功，它更像打猎，看见第一个猎物你开了一枪，没打中，没关系，继续瞄着等第二、第三个猎物，只要打中一个，接下来一个星期就有东西吃了。我们只要抓住机会努力成功，成了一两次，就能上到一个完全不同的层次，而这之前的多次失败，都在不断地帮我们积累经验。",
        "12. 终于来到哈佛后，你觉得与自己之前所想的相同吗？",
        "程卓: 我觉得还是超出我的预期。或者说一开始对于在哈佛的学习，就没有很多的预设，我觉得在这里学习也有点像 Liberal Arts Education，加深我自己对社会的理解。而我在这里上了这么多课后，觉得自己对于世界的理解真的比以往更加深刻、坚定。另外也学到了很多实用的技巧，比方说我们真的是用了一学期时间，扎扎实实上了谈判课，这些技巧在我后来协商谈判时确实都用上了。",
        "13. 给学弟学妹推荐一下这门课？",
        "程卓: 这门课叫 Negotiation across Differences，分为上下两部分，上半程会教谈判的基础，了解各种不同的背景、立场和情境中的谈判。下半程更有意思，课名中的 difference 是指 power 的不同，谈判中各方的 power 不一样，在练习时你会被放在更弱或者更强的一方，根据自己的情况尽可能地去争取利益。",
        "14. 分享一个你在哈佛和MIT这边印象最深刻的learning moment？",
        "程卓: 非常多，一定要说一个的话应该是创业吧。我觉得 MIT 有全美最棒的创业教育系统之一，无论是从它的创业课程体系，还是大大小小的孵化器、基金、比赛，甚至身边的同学和整体的创业氛围。还有波士顿在VC方面的集中程度，也是美国非常顶尖的，所有的这些都给你创造了一个非常好的创业生态环境。而且即便你不想毕业就马上创业，在人生中的某个阶段一定也会想去创造一些东西，到那时候学到的东西就会派上用场。",
        "15. 你会推荐同学们在学校期间创业吗？",
        "程卓: 我觉得首先取决于每个人自己的目标。我也有很多同学对创业没什么感觉，或者风险偏好较低，这些都取决于个人。但如果真的想尝试创业这个事，在学校里面做起来是相对风险比较小的。这里有学校的资源、老师的指导，不必自己面对很大的经济压力，而创业这件事没有人指导的话也容易交很多学费，在学校算是低成本试错。",
        "创业项目 BeenThere",
        "16. 聊一聊你的创业项目BeenThere，最开始这个想法是怎么来的？",
        "程卓: 这个想法可能是过往经历中很多个点交织在一起。最早是我自己做 coach的经历，在麦肯锡的时候有一个培训内容就是 coaching，通过助人自助的方式，让你探索自我，达到更好的目标，当时学的时候我就非常喜欢，也觉得自己比较擅长。",
        "第二个点是我在 MIT 参加了一个 Hackathon，类似创业大赛，我们团队当时做了一个智能笔记本，希望解决留守儿童孤独问题，最后进了决赛。比赛结束后大家都很激动，想继续推进，于是就有了最开始的 BeenThere。当然那之后我们的想法变了几次，团队成员也换过几次，但想做心理健康领域这点一直没有变，也坚持到现在。",
        "第三个点是身边同学的经历。很多同学知道我在做心理健康后，会跟我谈起自己面对的心理挑战。平时大家相处时是把自己好的一面展现出来，所以我们可能会低估周围人面对的心理问题。后来我们也查了很多数据，无论是在中国还是美国，基本都有六分之一的成年人有心理疾病，根据国内一项城镇居民心理健康状况白皮书，在这六分之一之外，还有74%的人处于心理亚健康状态。所以我们觉得心理健康这个方向既具有巨大的社会价值，也有很强的商业价值。",
        "17. 你觉得创业初期，最难的事情是什么？项目运行了两年多，到现在最难的事情又是什么?",
        "程卓: 创业确实没有不难的事，而在开始阶段最难的，我觉得是对领导力的挑战。我称创业为领导力的地狱模式，因为在公司或者在学校组织进行领导管理时，都有一定的 formal power，也能预期一定的回报，但在创业中这些都没有，你甚至不确定自己的想法能不能成，我觉得这是对领导力的巨大考验。",
        "而现在最难的可能不是这个了，过去两年多我们已经建立了一定的形象，也取得了一点成绩。现在最困难的是如何平衡它与自己的学习生活、职业生涯。我觉得这可能是每一个校园创业者迟早会遇到的问题，到底要不要全职来做。作为兼职的学生团队，很多想实现的东西只能一步一步来，同时兼职团队对投资人的吸引力也比较小。不过另一方面这可能也是好事儿，我们不以拿投资作为衡量的标准，而是要持续地把它做下去，所以我们也会继续加油。",
        "18. 你对 BeenThere 的未来展望是怎样的？",
        "程卓: 我们希望 BeenThere 未来能在心理健康界创造一种新的互动模式，新的提供支持的方式。我们会成为心理咨询师的前一站，希望通过同伴互助的方式帮助更多人去预防心理问题，在这种新的模式下，所有人都能够获得心理方面的支持。另一方面，我们希望它成为一种新的匿名社交方式。现在的匿名社交已经有很多成功或不成功的，但是我觉得 BeenThere 的匿名社交会是一个不同的方式，它基于我们的情绪、烦恼，基于一种互助的精神、一种非常健康向上的能量。",
        "聊一聊自己的生活",
        "19. 如何能保持高效，做成这么多事情？",
        "程卓: 从两个角度来说吧。一个是不要怕失败。可能你看到一个人做成了五件事，但背后他可能尝试了五十件事，所以我一直说其实身边那些非常厉害的人，平时都挺灰头土脸的。如果要做成这么多事，就是多尝试多失败，别怕失败。",
        "另外关于具体的时间管理，也有几点。第一点是要想清楚不做什么。这件事其实没有看上去那么容易。战略大师迈克尔·波特说过战略的一个基石就是要知道自己不做什么，要有一个明确的处理事物的范围。对我自己来说，在双学位和创业之外，我也放弃了很多，比如我从来不去找工作，也不参加任何学生社团的领导岗位，对自己的成绩也不苛求，这样才有精力投入对我最重要的事情。",
        "第二点是要有一个良好的习惯，这个习惯可能每个人都不一样，但一定要摸清楚自己身体的脾气。我是个 early person，早睡早起就会特别有效率；另外我会给自己做每周计划表，规定自己一周只做八件事情，如果有其他的事情要加进来，就逼迫自己把原来八项中的一项排除。在排优先序列的时候，我会挑让我最焦虑的事情先做，焦虑指标就是我的优先序指标。最后就是，实在不行也别逼自己，我们都有人性的弱点，别跟自己太较劲。",
        "20. 你经历过很多高水平的平台，在这样的环境中怎样能够保持自信、坚定地走自己的路？ ",
        "程卓: 在我看来最重要的是要意识到，我们不只在一个维度上竞争。可能很多时候焦虑的来源是竞争维度单一，比方说以前只有高考这一条路，分数是唯一的维度。但其实人生竞争的维度特别多，可能你的工资比我高，但我的社会地位比你高；可能你的成就很高，但我过得很悠闲快乐，大家都不在同一个赛道上了，这个时候就没有那么容易焦虑。不跟别人比，只跟自己比，尽力去实现自己希望的东西。",
        "另外还需要一个心态的调整，要敢于去做暂时没有被主流所承认的事情。这其实也不容易，需要定力，但是一旦敢去这么做了，可能焦虑程度也会下降很多。我听过一句话，“如果有一个机会，大家都觉得是好机会，那就一定不是个好机会。”所有人都觉得是好的，竞争就很充分，必须杀出红海才能赢。真正的好机会一定是大家还没发现的，而你去做了，就比别人更容易成功。所以我觉得有时候要敢于做还不被主流所承认的事。",
        "21. 见过这么多优秀同辈，你觉得这些人有共同的特质吗？",
        "程卓: 好问题，回想起来我觉得每个人优秀的方式都很不一样，成功的方式也很不一样，其实挺难归纳出一个共有特质。就像武林门派一样，每个人都有自己的方式，可能有时会觉得大家都很 driven，但也有像阿甘这样按照自己的节奏，一步一步走向成功的。有时候我们会高估一个人在短期内能够实现的东西，又低估一个人在长期积累下能实现的东西。",
        "22. 平时有哪些获取信息的方式？还有哪些爱好？",
        "程卓: 获取信息，一个肯定是通过课堂，然后是新闻。我会听“得到”和“樊登读书”这类的播客，还有就是阅读。另外还有跟人聊天，这个其实很重要，你会获得很多 informal information，或者叫 know how——知道怎么做一件事情，这些是很难在书本上获得的知识。",
        "另外前阵子我也在反思，发现自己的信息源太多，信息太嘈杂，所以我建议要谨慎选择获取信息的源头，尽量选择可靠的、高质量的信息源，另外也可以选一些不同立场的信息对照着看。",
        "爱好是读书，喜欢读一些经典，因为时间有限，还是放在一些经过时间验证的作品上。",
        "23. 可以推荐一本自己喜欢的书吗？",
        "程卓: 要说推荐的话，《习惯的力量》。我觉得养成一个好的习惯太重要了。很多时候我们会觉得一个人很强是依靠强大的意志力，但意志力就像做俯卧撑一样，总有做不动的那一下。而依靠意志力先养成一个习惯，就可以让习惯的惯性推动着往前走。有了一套好习惯，就相当于有了一套好算法，能够不断地让你快速迭代。",
        "24. 你觉得你的人生哲学是怎样的？",
        "程卓: 这个问题有意思，从最大的层面来说，我们活着为了什么，我觉得人生就像一场电影，虽然结束后不一定有意义，但仍然是值得看的，因为过程会很精彩。我们的生命在宇宙的尺度下不一定有什么意义，但仍然是值得过的，我们要让自己过得精彩。",
        "25. 2020年是很特殊的一个节点，你对自己未来十年有什么展望和期盼？",
        "程卓: 我觉得未来十年对我最重要的是找到一个平台，曾经在清华波士顿校友会上有一位学姐的分享我印象很深，她说对于职业发展，二三十岁的时候主要是长本事，三四十岁的时候要搭平台，四五十岁的时候要在自己的平台上发光发热。我很认同，我对平台的定义就是个人能力的放大器，帮你形成更大的影响力。它可以是个很优秀的公司，也可以是投资，或者其他的东西，whatever best amplifies your capabilities to achieve what you want.",
      ],
      image: "22.jpg",
      active: false,
    },
    {
      userid: "2",
      articleId: 3,
      title: "为什么我的计划总是坚持不下来？｜ BeenThere Coach",
      content: [
        "我自己是“易上瘾”体质，玩起游戏是真停不下来，但想做的事还偏偏很多。于是一路求仙问药，抱着“神农尝百草”的精神，变着法尝试管理自己的时间。从经典的《高效能人士的七个习惯》，到自创的神奇 Excel，从庸俗的物质金钱激励，到超脱的“清心寡欲，淡泊明志”，还有你懂的“暑假每日作息计划表”...... 真可谓伤痕累累。",
        "但是这段经历也带给我很多思考和收获。比如我发现，世上无难事，只要肯放弃。时间管理的重点并不是怎么每天多挤出俩小时来；相反，首先是要想清楚不做什么，然后勇敢地划掉那些并不重要的东西。放弃该放弃的，百分之七十以上的问题就解决了，剩下百分之二三十，才到了技术层面。渐渐地，我形成了一套比较适合自己的方法论，让我能够在同时攻读哈佛和麻省理工两个全职硕士学位的同时，还可以创业做 BeenThere，每周认识新的人，晚上睡足八小时，周末忍不住了可以打游戏。希望这套方法对你也有启发。",
        "为什么计划坚持不下来？那要先看这个计划靠不靠谱。如果计划不靠谱，当然坚持不下来。你可能想了，这不是废话吗，我这么靠谱，做的计划肯定靠谱啊。慢着慢着，还真不一定，越靠谱的同学，计划越容易不靠谱，有的简直是反人性，要逆天。我见过雄心勃勃同时要做N件事儿的，见过啥都想学、啥都要插一脚的，见过每天就睡三四个小时的，各种“我要打十个“的既视感，真是凭实力单身。",
        "越是优秀、上进的人，越容易产生一些“妄念”，包括但不限于，“我的未来还有无限可能性”，“我可以把它们都做好”，“我比周围的人牛X”，“我比前人牛X“...... 之前一篇文章《我们不需要满分答卷》里提到理想和现实的落差，在我看来，所谓“到社会上接受打击、向社会低头”，实质上就是我们不断在外界反馈中发现自己的真实水平，主动或被动消除“妄念”的过程。",
        "成熟，就是接受只能做一件事的自己。而时间管理最大的敌人，就是给自己安排了太多的事情，贪多嚼不烂，还把自己弄得惶惶不可终日。我个人觉得，“我的未来还有无限可能性”这句话，危险系数当拔头筹。因为每保留一种可能性，就需要投入一部分精力让这扇门“开着”。研究表明，越是聪明的人，越不愿意把”门“关上，最终没了时间去干正事。",
        "然而世界第一流的智慧都在告诉我们，要去勇敢地关上这扇“门”。我曾经做过四年的企业战略咨询，现代战略管理之父迈克尔·波特曾说过，战略的一个重要基石，就是决定不做什么。如果一个企业什么都想做，平均地投入资源，就什么也做不好。巧了，咱们东方的《孙子兵法》同样有言：“备前则后寡，备后则前寡，备左则右寡，备右则左寡，无所不备，则无所不寡。”",
        "那难道我们真的就没有办法把事情都做好、做得比周围人和前人更好吗？方法当然有，可惜不是“打十个”——同时做十件事不难，坚持做好一件事，很难。基于我们都是普通人的认知，专注在最重要的一到两件事情上，在时间的积累下不断迭代、调整，我们反而更有可能在某个领域做出超乎常人的成就。我们的成功不需要去全面的碾压别人——尺有所短、寸有所长，这个世界谁比谁聪明多少？相反，人无我有，人有我无，你好你的，我好我的，在复杂的世界中找到属于自己的独特“生态位”，集中投入资源，牢牢占据它，这才是更加实在的成功之法。",
        "分享一个我给正在读MBA期间的自己制定的“人生战略”。我目标聚焦于创业创新，因为我相信：",
        "1. 创业创新是我们国家产业升级和持续发展的动力，也是一项稀缺的能力",
        "2. 创业创新是个人职业生涯实现跨越式发展的有效途径",
        "3. 麻省理工学院和大波士顿地区的创业教育及资源位居全球前列",
        "因此，我将课堂学习之外的主要精力都投入在了创立 BeenThere 这一件事情上，同时放弃了所有跟“找工作”相关的活动、不参与任何学生社团的领导岗位、限制自己花在课堂和社交上的时间，这才有了文章开头所说的睡足八小时、周末打游戏。（关于我与游戏互相驯化的惨烈故事，改天开个“网瘾篇”吧...）",
        "咳咳，所以说，时间管理，制定一个不坑爹的计划，想清楚要做的，放弃不该做的，我们就成功百分之七十以上了！剩下的百分之二三十，咱们以后慢慢聊。同学们加油！！",
      ],
      image: "23.jpg",
      active: false,
    },
    {
      userid: "2",
      articleId: 4,
      title: "我和我的四拨前任们丨BeenThere创始人爆料",
      content: [
        "作者/橙子丹尼",
        "如果你顺着标题点进来，恐怕会有点失望。这不是一个爱情故事，而是一个在一次次挫折中理解自己和他人的故事。但如果你继续，读完我四段失败的“恋情”，或许，又会有更大的收获。谁知道呢？我们开始吧",
        "01",

        "多年以后，当与旁人提起自己在麻省理工的创业经历时，我定会回想起2017年9月那个遥远的下午。那时的我刚结束麦肯锡四年的咨询顾问生涯，进入麻省理工与哈佛大学攻读双学位。少年得志，意气风发。",

        "“Sky is the limit.” 仍记得离开前一位合伙人给我的那个巨大的拥抱，以及这句满含期许的话语。",

        "那个下午，正值麻省理工一个创业比赛的决赛。经过两天一晚的彻夜努力，我和四位队友振奋精神，向评委展示了为解决人们的心理健康问题而设计的AI智能日记。我们最终没有夺冠，但是那个夜晚都兴奋难眠。 ",

        "“咱们现在要做的，是拿去参加Sandbox, Y-Combinator这样的创业孵化项目，直接拿到上万美元启动资金…… 这些项目才是真挑战、真机会！” ",

        "我是被“随机”拉入这个比赛的，事前没有任何规划，然而那个下午却深刻地影响了我之后的所有生命。因为创业，我从头召集过四拨团队，又眼见着它们一个一个土崩瓦解；我曾在路演中被各种橄榄枝撩得晕头转向，也曾在各种留学论坛宣传产品的时候被骂、被封、被删帖；因为产品的目标是国人，我没有交到一个外国朋友，却对MIT所有跟创业沾边的华人团体了如指掌；我没有在任何社团担任任何职务，却同很多悄悄告诉我被抑郁困扰的朋友保持着密切的联系。 ",

        "所有这些经历中，同四拨团队的分分合合是带给我反思与成长最多的一段。里面不乏狗血剧情——公开的翻脸、挚友的疏远、被要挟、被欺骗、被夺权……没经历过创业的人或许不会相信，但是懂的人一定会懂。",

        "都说恋爱让男孩成长。找合伙人的难度不亚于找“另一半”，而同“前任”团队们的分分合合，也让我在许多不眠的夜里、在一个全新的维度上，快速成熟。",

        "回头再看，山川如旧。经历过许多，也变得平和，对朋友们的选择，心中多了一份理解，少了千般怨忿；自己也能坐下来，总结犯过的错误，希望能帮到对创业怀有好奇或憧憬的你。",
        "好了，下面上干货！",
        "02",
        "创业项目最大的“死因”之一，就是团队问题。一个创业圈的前辈曾告诉我：“我就没见过身边的团队里创始人间没出过问题的。”在麻省理工的创业课上，一位演讲嘉宾把他们团队从第一拨人到第七拨人的成员变动，画了一整页的PPT，等到最后一拨时，他自己的照片也不在里面了…… ",
        "所以说，团队真的很重要！团队真的很重要！团队真的很重要！ ",
        "要抱着找老公/找老婆的觉悟去找合伙人。",
        "尤其是从大企业或者名校出来的同学，更要引起重视。我们通常会低估靠谱合伙人的价值，进而低估寻找靠谱合伙人的难度和重要性。因为自己过去合作的人都太优秀了，很容易认为理所应当。比如，我曾经自信满满：身在MIT，这么多同学朋友，还找不到一个MIT博士来做CTO吗？对不起，就是找不到。你是在和谷歌苹果亚马逊抢人。而且事实上，非名校背景的同学，也同样可以是很靠谱的合伙人。不以出处论英雄。",
        "“找老公/老婆”还意味着要从“眉来眼去”开始，慢慢约会，培养感情。要有耐心，不能着急。想当初我跟人见了一面聊得不错，第二天就拉人入伙，这就跟刚要到女孩微信号就立刻求婚一样，简直是如狼似虎，保准把人吓跑。 ",
        "最后，“结婚”意味着你要准备好接受对方糟糕的一面。“合伙人”不同于“同事”。在企业里，大家都是拿出最好、最靠谱、最职业化的一面见人，每个人都无比可爱。但是一旦没有了平台的加持和约束，又面临公司生存压力和个人机会选择，每个人天性的另一面就会暴露出来。别惊讶，每个人都有。比如说，我会有管不住自己通宵打游戏的时候，结果导致第二天的全体会议被取消，弄得大家都很无语。但是这样的深度合作，我们必须接受彼此的缺点。 ",
        "分清“创业者”和“创业爱好者”。",
        "就像你想谈一场认真的恋爱，肯定不希望遇到拈花惹草、只想玩玩的“花花公子”一样。“创业爱好者”就是这样一群“花花公子”。 ",
        "没有贬低的意思，因为我们都是这个阶段过来的。那时对创业充满好奇，觉得动不动融个几千万又上杂志封面很酷，很想试试，也想学学。于是我们充满热情地加入一个团队，而且分文不取，就像又参加了个社团一样。 ",
        "然而一段时间过去，你发现项目并没有起色，而要投入的时间却越来越多。你开始琢磨，原来还不如加个学生会，能费这么大劲，早当副主席了；或者去找工作，那也是妥妥的中产阶级。终于，在期中考试黑云压城的那周，你请了假，之后再也没有回来。 ",
        "“创业爱好者”可以成为创业者很好的助力，请爱护这群可爱的人们，但一定要管理好我们的期待。否则，最后的结果多半会让你失望。",
        "“吸” 着队伍走，不要 “推、追、催”。",
        "这就像追女孩子一样。",
        "女孩从来都不是“追”来的，而是你自己足够优秀，“吸”来的。“追”的那一下，顶多是开头引起注意，结尾临门一脚，兄弟们不能本末倒置。",
        "创业团队也是一样。我曾经万分苦恼地求教一位创业前辈，如何能尽快做出一个quick win，稳住团队往前走。然而他的回答出乎意料：“为什么要留住团队？你真正要留下的，是那个没有quick win也要赌咒把这件事干成的人。否则他现在不走，困难时刻也会走。”",
        "我如梦方醒。回头看看自己拉扯起来的号称十几个人的队伍，其实不过是哈布斯堡的“布娃娃家族”，列强一打，蛋碎一地。",
        "要吸引真正“能打”的合伙人，不能靠利益（因为 cost-benefit 永远不在你这边），不能靠忍让（因为他会骑到你的头上去），更不能靠哄骗，而唯有靠愿景、靠这件事本身。TA得要觉得这件事真心有意义，不给钱都要干，不让干自己干，这才是你的命中注定。",
        "会不会太难找？谁说创业容易了。送你一句北大教授送我的话：“让别人相信你的最好办法，就是坚定不移地去做。”",
        "人多不一定力量大，尤其在决策这件事上。",
        "就像小两口的事情，虽然两家人都利益相关，但也不意味着啥都要七大姑八大姨来批准。",
        "决策的人一多，必然拉帮结派，斗争复杂度急剧上升。有几个星期，我天天在琢磨“拉一派、打一派”，事情没做几件，倒是在小小的学堂，体验了",
        " 高效决策的背后，还有分工和信任。曾经有一个MIT的本科生，人非常聪明，也非常勤奋。但是他有一个致命缺点，就是事事都要争论，事事都有自己的看法。每做一个决定，都要我给他一个完全没有受过商业训练的人普及Commerce 001，经过几番来回，真是身心俱疲。我把产品的重要部分交给他做，是信任他的产品能力；如果他也能信任我的商业判断，而不是拿手中的产品作为筹码，我们的合作会愉快很多。",
        "03",
        "与创业团队悲欢离合、吃鸡撕逼的故事还有很多，对于曾经心比天高的我，真是人生重重的一课。",
        "然而，我最重要的一课，却是来源于Donna，我在MIT的一位创业导师。她曾成功创立了一家拥有2千万用户、业务横跨18个国家并成功上市的社会企业。",
        "那天我走进她的办公室，心情烦闷无比，将创业以来的种种挫折与不快、疑惑与烦恼，通通倾吐给她。她静静地听完，看着我的眼睛，只说了一句 “I’ve been there",
        "就在那一刹那，我心里的重担烟消云散。原来，我并不是最惨的那一个；原来，我的故事竟有一人也曾经历过。再多的安慰，再多的劝解，其实，都比不过那一句“I’ve been there.”因为，我们在困难当中，最最需要的，只是有一个人，能够真正地理解自己",
        "就这样，BeenThere，成为了我们新产品的名字。我重又拉起了第五拨队伍。虽然产品已经不同，但是提升人们心理健康的目标，却从未变过。中国近1/6的城镇居民患有心理疾病，而70%以上处在心理亚健康状态。然而，受到到观念、偏见和供给的制约，绝大多数国人仍远未得到应有的心理支持。",
        "正在读文章的你，快乐吗？而我们BeenThere公众号想做的事情很简单，让经历过的人帮助正在经历的人，告诉他们一句，“I've been there”。",
        "回首过往，向我的四拨“前任”们报以释然的微笑，经历种种让我更懂你，也更懂自己；向前，路在脚下，哪怕这个问题仍然没有成熟的解决方案、这个领域仍然不是资本市场的宠儿，我还是要撸起袖子，向它挑战。",
      ],
      image: "24.jpg",
      active: false,
    },
  ];
  const { article, name, id } = props;
  const articleRef = useRef();
  const handleClick = (id) => {
    const newArticles = articles.map((article) =>
      article.articleId === id
        ? { ...article, active: true }
        : { ...article, active: false }
    );
    setArticless(newArticles);
    if (expand) {
      setExpand(!expand);
    }
    articleRef.current.scrollIntoView({
      behavior: "smooth",
      block: "center",
    });
  };
  const [articless, setArticless] = useState(articles);
  const [expand, setExpand] = useState(false);
  const [more, setMore] = useState(false);

  const handleExpand = () => {
    setExpand(!expand);
  };
  const handleMore = () => {
    setMore(!more);
  };
  return (
    <Section expand={expand} more={more} ref={ref}>
      {article && (
        <React.Fragment>
          <div className="title">TA的文章</div>

          {articless
            .filter((article) => article.active && article.userid === id)
            .map((article, index) => (
              <div key={index}>
                <div className="article">
                  <img
                    src={`/articles/${article.image}`}
                    alt="gallery"
                    className="article--image"
                  />
                  <div className="article--title" ref={articleRef}>
                    {article.title}
                  </div>
                  <div className="article--content">
                    {article.content.map((par, index) => (
                      <p
                        key={index}
                        style={{
                          marginBottom: "20px",
                          textAlign: "left",
                          padding: "0 15px",
                        }}
                      >
                        {par}
                      </p>
                    ))}
                  </div>
                  <div className="article--expand" onClick={handleExpand}>
                    {expand ? "收起" : "展开"}
                    {expand ? closeIcon : expandIcon}
                  </div>
                </div>
              </div>
            ))}

          <div className="bar"></div>
          <div className="articles">
            {articless
              .filter((article) => article.userid === id)
              .map((article, index) => (
                <ArticleItem
                  key={index}
                  active={article.active}
                  onClick={() => handleClick(article.articleId)}
                >
                  <figure className="shape">
                    <img
                      src={`/articles/${article.image}`}
                      alt="gallery"
                      className="image"
                    />
                  </figure>
                  <div className="text">
                    <h3 className="title">{article.title}</h3>
                    <p className="content">
                      {article.content.map((par, index) => (
                        <span key={index}>{par}</span>
                      ))}
                    </p>
                  </div>
                </ArticleItem>
              ))}
          </div>
          <button className="button" onClick={handleMore}>
            查看更多{" "}
          </button>
        </React.Fragment>
      )}
    </Section>
  );
});
export default React.memo(BuddyVideo);
