import React, { useState } from "react";
import { Container, HeaderContainer } from "./style";

// import { CSSTransition } from "react-transition-group";
export default function Policy(props) {
  // const [showStatus, setShowStatus] = useState(true);
  // const handleReturn = () => {
  //   setShowStatus(false);
  // };
  return (
    // <CSSTransition
    //   in={showStatus}
    //   timeout={300}
    //   classNames="fly"
    //   appear={true}
    //   unmountOnExit
    //   onExited={() => props.history.goBack()}
    // >
    <Container>
      <HeaderContainer>用户协议</HeaderContainer>
      <div className="sub">
        2020年7月24日 <br />
        欢迎使用 BeenThere
        线上一对一文字匿名同伴心理支持服务！（以下简称“本服务”） <br />{" "}
        BeenThere 是上海彼巷文化传媒有限公司运营的一个同伴互助平台（以下简称
        "BeenThere“，“平台”），我们致力于通过同伴的力量帮助您改善心理状况、提升幸福指数、预防心理疾病，但是不提供专业的心理健康、医疗、法律咨询等服务。
        <br /> 请仔细阅读
        <span className="sub--highlight">
          《BeenThere 线上一对一文字匿名同伴心理支持服务使用协议（来访者版）》
        </span>
        （“本协议”）的全部内容，如有疑问，请通过网站渠道向我们留言沟通。如您未满18周岁，或以其他形式属于限制民事行为能力人，请在监护人或法定代理人的陪同下阅读本协议。
        <br />{" "}
        <div className="part">
          <div className="part--title">一、特别说明 </div>1.
          在使用我们的服务前，请认真阅读本协议。 <br />
          2. BeenThere
          会根据实际情况需要在必要时修改相关条款并在平台上作出更新。如有重大内容调整，BeenThere
          平台将对所有关注者和来访者作出说明和公告。 <br />
          3.
          若您接受本服务，将默认您已阅读、知晓、并接受本协议中所列明的所有款项，包括接受平台对本协议内容进行的所有修改。
        </div>
        <div className="part">
          <div className="part--title">二、定义</div> 1. “来访者”
          指在平台上接受本服务的个人用户（或称
          “Mentee”、“学员”）。对于未满16周岁的未成年人，BeenThere
          暂不提供本服务。
          <br /> 2. “Buddy” 指在平台上为来访者提供本服务的个人用户（或称
          “Mentor”、“顾问”）。
          <br /> 3. “用户“ 指在平台上接受和提供本服务的双方，包括
          ”来访者“和”Buddy“。{" "}
        </div>
        <div className="part">
          <div className="part--title">三、本服务流程及注意事项</div> 1.
          来访者通过网站上的即时聊天窗口，同 Buddy
          进行一对一的在线匿名文字交流；服务自来访者接受本协议时起，到聊天结束或聊天窗口关闭为止。
          <br />
          2.
          平台不断创新以向其用户提供最优体验，来访者认知并同意平台提供的服务的形式和本质可不经事先通知您而不时变换，平台保留随时变更、中断或终止部分或全部网络服务的权利。
          <br />
          3.
          平台在提供服务时，可能会对部分服务收取一定费用，平台将会对收费服务给予明确的提示。
          <br />
          4.
          来访者认知并同意，如果平台禁用对来访者的帐户的访问权，则来访者可能被阻止获得服务、来访者的帐户资料或包含在来访者帐户中的任何文件或其他内容。
        </div>
        <div className="part">
          <div className="part--title">四、本服务内容限制</div> 1. 平台和 Buddy
          本着与来访者自愿平等、相互尊重的原则开展本服务，来访者不得对 Buddy
          和平台提出除本服务列明内容外的无理要求；对于来访者在本服务列明内容外的要求，平台和
          Buddy 有权拒绝。 <br />
          2. 在本服务之外，Buddy
          没有义务同来访者保持任何形式的联系或为来访者提供任何形式的服务。双方均不得在任何情况下发展超出友谊的亲密关系，也不得在平台之外进行私下的收费辅导活动。一经发现，平台有权将
          Buddy 除名并拒绝在未来为来访者提供服务。 <br />
          3. 本服务中， Buddy 将尽己所能为来访者提供帮助，但平台不对 Buddy
          在本服务的过程中和服务结束后提供给来访者的沟通内容的有效性、准确性进行任何形式的保证。对沟通中包含的建议和沟通本身所带来的潜在风险不承担任何责任，这些风险包括但不限于情绪的恶化、实施
          Buddy 提出的建议所带来的风险、同 Buddy
          互动过程中存在的其他不可预知的风险等。 <br />
          4. Buddy
          并非取得任何相关执照的心理咨询、医疗健康、或法律相关人士。本服务不能代替以上各类的专业服务。来访者应对自身情况进行判断，如有需要，强烈建议来访者接受相关专业服务。当平台或
          Buddy 判断来访者存在上述专业服务的需求、或本服务给 Buddy
          本身带来极大情绪困扰时，平台和 Buddy 有权拒绝为来访者继续提供服务。
          <br />
          5.
          来访者不得滥用、误用、干扰、或以非正常的方式获取本服务。来访者需在遵守当地法律法规的前提下使用本服务。当来访者未能遵守本协议或者平台正在调查涉嫌不当行为时，平台有权暂停、中断和终止向来访者提供服务。
          <br />
          6.
          平台不限定话题内容，但平台使用者不得以任何形式在线上、线下、产品后台出现不当行为或言论，该行为或言论包括但不限于：
          <br />
          <span>
            &nbsp;a. 违反法律规定的，煽动抗拒、破坏宪法和法律、行政法规实施的；
          </span>
          <br /> <span>&nbsp;b. 煽动颠覆国家政权、破坏民族团结的；</span>
          <br />{" "}
          <span>&nbsp;c. 捏造或歪曲事实、散布谣言、扰乱社会秩序的； </span>
          <br />
          <span>
            &nbsp;d. 带有种族／性别／取向／国籍／身体／精神／智力歧视的；
          </span>
          <br />
          <span> &nbsp;e. 侮辱诽谤、恶意中伤攻击的； </span>
          <br />
          <span>&nbsp;f. 发表或讨论政治／宗教观点的；</span>
          <br />
          <span>
            &nbsp;g. 宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、毒品的；
          </span>
          <br />
          <span>
            &nbsp;h.透露他人的隐私信息：包括真实姓名、联系方式、家庭住址、照片视频、聊天记录、社交网络账号的；
          </span>
          <br />
          <span>&nbsp; i. 言语过分粗俗的；</span> <br />
          <span>
            &nbsp; j. 包含任何商业诱导、广告、站点引导的；
            若出现以上内容，平台和 Buddy 有权拒绝开展或中止正在进行的本服务。
          </span>
          <br /> 7.
          平台没有义务对所有用户的注册数据、所有的活动行为以及与之有关的其它事项进行审查，但如存在下列情况，平台有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任：
          <br /> &nbsp;a.
          用户或其它第三方通知平台，认为某个具体用户、具体行为、具体事项可能存在重大问题；
          <br /> &nbsp;b.
          用户或其它第三方向平台告知网络平台上有违法或不当行为的，平台以普通非专业人员的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的。
          <br /> 8.
          平台有权对用户的注册数据及活动行为进行查阅，发现注册数据或活动行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除等处理。
        </div>
        <div className="part">
          <div className="part--title">五、服务变更</div> 1.
          除本协议另行说明外，若用户出现任何违反本协议的行为，平台有权立刻终止对用户的服务。平台保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于服务的中断或终止而造成用户的损失的，平台不承担任何责任。
          <br /> 2.
          平台保有对平台及服务全部或部分内容随时进行调整变更、中断、或终止的权利。
          <br />
          3.
          除非另有明确指示，平台对所提供服务进行的任何增添、更新、和强化均受本文条款限制。
          <br />
          4. 因系统维护或升级的需要而需暂停网络服务，平台将尽可能事先进行通告。
          <br /> 5. 服务发生变更、中断、终止后，平台仍有以下权利： a.
          平台有权保留用户的注册数据及以前的行为记录； b.
          如用户在服务变更、中断、终止前，在平台上存在违法行为或违反条款的行为，平台仍可行使本服务条款所规定的权利。
        </div>
        <div className="part">
          <div className="part--title">六、隐私声明</div> 1. 适用范围 <br />
          &nbsp;a. 来访者使用本服务时，根据网站要求提供的个人信息；
          <br /> &nbsp;b.
          来访者使用本服务时，上传的非公开的申请单资料等文字、图片、数据信息；
          <br /> &nbsp;c. 平台通过合法途径从其他途径取得的来访者的个人资料；
          <br /> &nbsp;d. 来访者认为不宜公开的其他内容。
          <br /> 2. 信息保密
          保护来访者的隐私是平台的一项基本政策，平台保证不对外公开或向第三方提供来访者的注册资料及来访者在使用网络服务时存储的非公开内容，但下列情况除外：事先获得来访者的明确授权；根据有关的法律法规要求；按照相关政府主管部门的要求；为维护社会公众的利益；为维护平台的合法权益。
          <br /> 3. 信息使用 <br />
          &nbsp;a.
          为服务来访者的目的，平台可能通过使用来访者的个人信息向来访者提供服务，包括但不限于向来访者发出活动和服务信息等。
          <br /> &nbsp;b.
          来访者知悉并认可：平台可能会与第三方合作向来访者提供相关的网络服务，在此情况下，如该第三方同意承担与本网站同等的保护来访者隐私的责任，则平台有权将来访者的注册资料等提供给该第三方。另外，在不透露单个来访者隐私资料的前提下，平台有权对整个来访者数据库进行分析并对来访者数据库进行商业上的利用。
        </div>
        <div className="part">
          <div className="part--title">七、版权声明</div> 版权内容 <br />
          1. BeenThere
          平台提供的内容受版权、商标和其他财产所有权法律保护，为平台所有，其中包括但不限于：
          <br /> &nbsp;a. 平台线上发布的所有内容； <br />
          &nbsp;b. 平台提供的所有服务、开展的所有活动中涉及的所有内容； <br />
          &nbsp;c. 平台内部信息系统中留存的所有资料；
          <br /> &nbsp;d.
          平台内部人员信息、财务信息、规章制度、活动方案、项目成果等内容；{" "}
          <br />
          &nbsp;e. 平台衍生的各类实体或虚拟智力或体力的劳动成果；
          以上内容格式包括但不限于文字、图片、视频、音频、数据、网页、应用、软件、电子文档、商标等。
          版权保护
          <br /> 1.
          任何将平台公开刊载的内容用于商业、盈利、广告性目的的行为需经过平台书面授权。
          <br /> 2. 所有平台用户、BeenThere
          成员（除内部必要的工作或交流之需外）、及其他接触上述内容的人群，未经平台书面许可，不得以任何方式或理由对上述产品、信息、材料的任何未公开刊载部分进行使用、复制、再造、制造衍生品。
          <br /> 3. BeenThere
          团队成员接触平台内部材料的，离开团队时必须自行归还所有材料，并删除所有自有的电子备份。
          <br /> 4.
          一切违反上述条款的不规范行为被视为侵权，平台有权依据相关法律法规追究经济赔偿和其他侵权法律责任。
        </div>
        <div className="part">
          <div className="part--title">八、免责条款</div> 1.
          本服务不属于疾病诊断或治疗活动，BeenThere
          不开展诊疗活动，不属于《医疗机构管理条例》的医疗机构。
          <br /> 2. Buddy
          并非BeenThere平台的雇员，也不是平台的代理人或代表，平台不对任何 Buddy
          的任何作为或不作为承担任何责任。
          <br /> 3. 平台提供的 Buddy 背景信息仅供参考，平台不对 Buddy
          的技能、学历、资质、证书、背景信息、个人经历的真实性进行鉴定、审查或保证。
          <br /> 4. 平台无法预测或评估匹配到的 Buddy
          的能力是否适合来访者的需求。来访者对于通过平台接触 Buddy 以及继续同
          Buddy 交流互动的决定负有全部责任，平台的角色仅限于为来访者提供接触到
          Buddy 的机会。
          <br /> 5. 平台不对下述项目作出任何承诺或保证： a.
          来访者是否能立刻匹配到 Buddy 并收到 Buddy 的回复 b. Buddy
          的倾听、交流、给出建议的能力或意愿 c. Buddy 的服务效果 d. Buddy
          给出的建议的有效性、适用性、准确性以及是否令人满意
          <br /> 6.
          鉴于平台是同伴互助的性质，平台不向有自杀倾向、自伤自残倾向、自杀未遂行为、确诊心理疾病、有严重创伤经历的来访者提供本服务，来访者需在接受本服务前承诺不存在上述情况；若在服务过程中发现来访者隐瞒了上述情况，或因自身原因而突发疾病或意外死亡，或因自身原因造成情绪失控而发生自伤、自残、自杀等后果，平台及
          Buddy
          将尽可能采取措施控制事态恶化，尽量为该来访者提供帮助，必要时与相关部门取得联系，但也保留随时终止服务的权利。由此造成的损害后果，平台和
          Buddy
          不承担责任。如来访者最终选择自杀，责任及后果将由来访者本人全部承担，与平台及
          Buddy 无关。
          <br /> 7. 平台不对 Buddy
          的行为、言论、及本服务过程中的任何相关延伸领域承担责任。
          <br /> 8.
          平台不对其发布的任何信息的实用性和适用性做任何形式的保证，并对信息给来访者带来的影响不承担责任。
          <br /> 9.
          平台不对基于本人意愿听取、采用、传播平台所提供信息可能对第三方造成的相关影响承担责任。
          <br /> 10. 本服务结束后，来访者与 Buddy 间的服务关系解除，平台不对
          Buddy 和来访者私人间或单方面的协议承担任何形式的责任或义务。 <br />
          11. 从第三方平台或其他渠道获取 BeenThere
          平台信息或链接的，平台不对任何信息链接来源第三方承担任何责任。
          <br /> 12. 平台不对由于服务变更为来访者带来的损失承担任何责任。
          <br /> 13.
          平台不对由不可抗力或平台无法预见、无法避免、无法克服的原因导致的系统崩坏无法正常使用或服务终止承担责任；但平台承诺将尽力及时修复。不论在何种情况下，平台均不对由于Internet连接故障，电脑，通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，黑客行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。
          <br />
          14.
          来访者同意独自就来访者在使用服务时创作、传送或展示的任何内容以及来访者做出该等行为的后果（包括平台可能遭受的任何损失或损害）承担责任（平台不对来访者或任何第三方承担责任）。
        </div>
        <div className="part">
          <div className="part--title">九、违约责任</div>
          来访者同意保障和维护平台及其他用户的利益，如因来访者违反有关法律、法规或平台管理规定而给平台或任何其他第三人造成损失，来访者同意全部承担。
        </div>
        <div className="part">
          <div className="part--title">十、服务条款修改</div> 1.
          平台有权根据服务情况变更、终止平台管理规定的各项条款，平台将会通过适当方式向用户提示修改内容。
          <br />
          2.
          如果用户不同意平台管理规定的修改，有权停止使用网络服务。如果来访者继续使用网络服务，则视为来访者接受平台对服务条款相关条款所做的修改。
        </div>
        <div className="part">
          <div className="part--title">十一、争议解决</div> 1.
          本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理，并以平台所在地的人民法院为第一审管辖法院。
          <br /> 2.
          如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。
          <br /> 3.
          BeenThere平台对平台发布的所有内容、列明的所有条款、开展的所有活动等一切有关事项有最终解释权。
        </div>
        <div className="part">
          <div className="part--title">十二、通知送达</div> 1.
          本协议项下平台对于用户所有的通知均可通过网页公告、电子邮件、手机短信、微信消息或常规的信件传送等方式进行；该等通知于发送之日视为已送达给用户。
          <br /> 2.
          用户对于平台的通知应当通过平台对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
        </div>
        <div className="part">
          <div className="part--title">十三、其他规定</div> 1.
          本服务条款构成来访者与平台对服务条款之约定事项及其他有关事宜的完整协议，除服务条款规定的之外，未赋予服务条款各方其他权利。
          <br /> 2.
          如本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本条款的其余条款仍应有效并且有约束力。
          <br /> 3. 本服务条款中的标题仅为方便而设，在解释本条款时应被忽略。
        </div>{" "}
      </div>
      <div className="sub">
        2020年3月21日
        <br />
        【BeenThere】（以下简称“我们”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将采取一切合理可行的措施，保护您的个人信息。
        请在使用我们的产品（或服务）前，仔细阅读并了解本{" "}
        <span className="sub--highlight">《BeenThere隐私权政策》</span>。 <br />
        <div className="part">
          <div className="part--title"> 一、我们如何收集和使用您的个人信息</div>
          个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
          我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：
          <br />
          （一）为您提供免费、匿名的线上一对一文字聊天陪伴服务
          为保证服务的匿名性，我们不会主动收集您的任何个人联系方式信息。但是您可以在聊天窗口中自愿提供以下信息：创建的用户名、电子邮箱地址。如果您不提供这些信息，将不会影响使用本服务的基本功能。
          在服务过程中及服务结束后，会产生文字聊天记录。
          您授权我们使用上述信息。 <br />
          （二）接受您成为BeenThere相关成员的报名申请 在申请成为Online
          Buddy的问卷中，您需要提供以下信息：您的姓名，您的微信号，您的常用邮箱，您的学校、专业或工作单位、现任岗位，您的自我介绍，您为什么希望加入BeenThere的陈述、您的简历（非必须）。
          在申请成为校园大使的问卷中，您需要提供以下信息：您的姓名、学校、年级及专业、为什么想加入BeenThere校园大使的陈述、您的微信号。
          在申请成为运营志愿者的问卷中，您需要提供以下信息：您的姓名、性别、微信号、学校/公司、年级、专业、感兴趣的领域、相关工作/实习/课外活动经历、为什么想成为
          BeenThere 运营志愿者的陈述、您的简历。 您授权我们使用上述信息。
          <br />
          （三）开展内部数据分析和研究，第三方SDK统计服务，改善我们的产品或服务【注：示例】
          我们收集数据是根据您与我们的互动和您所做出的选择，包括您的隐私设置以及您使用的产品和功能。我们收集的数据可能包括SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、独立设备标识符、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、时区和网络状态（WiFi等）、硬盘、CPU和电池使用情况等。
          当我们要将信息用于本策略未载明的其它用途时，会事先征求您的同意。
          当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
        </div>
        <div className="part">
          <div className="part--title">二、我们如何使用 Cookie 和同类技术</div>{" "}
          （一）Cookie
          为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie
          的小数据文件。Cookie
          通常包含标识符、站点名称以及一些号码和字符。借助于
          Cookie，网站能够存储您的偏好或购物篮内的商品等数据。 我们不会将 Cookie
          用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
          Cookie。您可以清除计算机上保存的所有
          Cookie，大部分网络浏览器都设有阻止 Cookie
          的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。如需详细了解如何更改浏览器设置，请参阅主要浏览器的用户手册或支持文件。
          <br /> （二）网站信标和像素标签 除 Cookie
          外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击
          URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
          <br /> （三）Do Not Track（请勿追踪） 很多网络浏览器均设有 Do Not
          Track 功能，该功能可向网站发布 Do Not Track
          请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了
          Do Not Track，那么我们的所有网站都会尊重您的选择。
        </div>
        <div className="part">
          <div className="part--title">三、我们如何保护您的个人信息</div>
          （一）我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据时受
          SSL、HSTS Secure加密保护；我们同时对我们网站提供 https
          安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会与志愿者以及其他BeenThere成员签署保密协议；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强BeenThere成员对于保护个人信息重要性的认识。
          <br />{" "}
          （二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
          <br />{" "}
          （三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。
          <br />{" "}
          （四）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
        </div>
        <div className="part">
          <div className="part--title">四、您的权利</div>
          按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
          <br /> （一）访问您的个人信息
          您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
          文字聊天记录——如果您希望获取文字聊天记录的备份，可以通过选择菜单栏中的“发送对话记录至电子邮箱“执行该操作。
          如果您无法通过上述链接访问这些个人信息，您可以发送电子邮件至【contact@beentherebuddy.com】。我们将在30天内回复您的访问请求。
          <br /> （二）更正您的个人信息
          当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过选择菜单栏中的“更改名称“和”发送对话记录至电子邮箱“执行该操作。
          如果您无法通过上述链接更正这些个人信息，您可以发送电子邮件至【contact@beentherebuddy.com】。我们将在30天内回复您的更正请求。
          <br /> （三）删除您的个人信息
          在以下情形中，您可以向我们提出删除个人信息的请求：
          <br /> 1、如果我们处理个人信息的行为违反法律法规；
          <br /> 2、如果我们收集、使用您的个人信息，却未征得您的同意；
          <br /> 3、如果我们处理个人信息的行为违反了与您的约定；
          <br /> 4、如果我们不再为您提供产品或服务。
          若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
          当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。
          <br /> （四）改变您授权同意的范围
          每个业务功能需要一些基本的个人信息才能得以完成（见本策略“第一部分”）。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。
          您可以通过“（一）访问您的个人信息”中罗列的方式自行操作。
          当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
          <br />
          （五）约束信息系统自动决策
          在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。
          <br /> （六）响应您的上述请求
          为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在三十天内做出答复。
          对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
          在以下情形中，按照法律法规要求，我们将无法响应您的请求：
          <br /> 1、与国家安全、国防安全有关的；
          <br /> 2、与公共安全、公共卫生、重大公共利益有关的；
          <br /> 3、与犯罪侦查、起诉和审判等有关的；
          <br /> 4、有充分证据表明您存在主观恶意或滥用权利的；
          <br />{" "}
          5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。
        </div>
        <div className="part">
          <div className="part--title">五、本隐私权政策如何更新</div>
          我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。
        </div>{" "}
        <div className="part">
          <div className="part--title">六、如何联系我们</div>
          如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：
          <br /> 邮箱：contact@beentherebuddy.com <br />
          一般情况下，我们将在三十天内回复。
        </div>
      </div>
    </Container>
    // </CSSTransition>
  );
}
